[
    {
       "title":"Crew Member",
       "subTitle":"Shipp and Wilson Ladnscaping Co.",
       "description":"Provided an excellent landscaping product for customers, as seen in our work for houses, apartment complexes, and businesses. As technician, I'm responsible for maintaining a safe work environment and giving our clientele a detailed and aesthetic product. As a crew, we installed new trees and plants, hardscapes, and removed old and unwanted landscapes.",
       "dates":"November 2019 - Present"
    },
    {
       "title":"Program Coordinator, Youth and Family Department",
       "subTitle":"Weinstein Jewish Community Center",
       "description":"As program coordinator, I created and directed youth activities to keep young members of the JCC active at the center. I maintained files and records of families in youth programs, and kept files consistently updated and organized. I directly supervised eight specialists and ten van and bus drivers for the summer camp, and helped the director and assistant director in day-to-day operations and overall staff supervision.",
       "dates":"December 2018 - October 2019"
    },
    {
       "title":"Operations Manager, Kids Place and Camp Hilbert",
       "subTitle":"Weinstein Jewish Community Center",
       "description":"As Operations Manager, I was tasked with keeping classroom rosters and family paperwork up-to-date for licensing purposes. I helped supervised twelve classroom staff and led a group of twelve drivers in proper training and vehicle maintenance checks. I created several organizational changes to aid in classroom transitions and closing procedures, record-keeping for the drivers, and operational procedures for the program coordinator who reported to me. I also created schedules and activities for every school break, such as winter and spring school breaks, which involved both on-campus and traveling programs for the children. Finally, I served as a direct point-of-contact for all parents and guardians in our programs, every school we picked children up from, and any vendors we had for our programs.",
       "dates":"December 2016 - December 2018"
    },
    {
        "title":"Program Coordinator, Kids Place and Camp Hilbert",
        "subTitle":"Weinstein Jewish Community Center",
        "description":"While serving as Program Coordinator, I ensured that each of our classrooms were prepared for the day, and kept track of cleaning and maintenance records for our counselors. I greeted parents in our check-in and check-out processes as well.",
        "dates":"August 2016 - December 2016"
     }
 ]